log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** Cross Compiling Template Haskell
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-05-25-cross-compiling-template-haskell
   :EXPORT_DATE: <2017-05-25>
   :ID:       9EAD4411-5732-4F6E-B501-1030A29F8A7B
   :END:

As laid out yesterday, there are some interesting questions pertaining
to [[https://medium.com/@zw3rk/template-haskell-and-cross-compilation-16b92f40c6ab][Template Haskell and Cross Compilation]]. Today we will put all the
pieces together and cross compile template haskell to our [[http://amzn.to/2qb8k10][Raspberry Pi]]
/with file and process IO/!

*** The External Interpreter
    :PROPERTIES:
    :ID:       992CAE94-435D-4509-A311-D38958A3427F
    :END:

[[https://ghc.haskell.org/trac/ghc/wiki/Commentary/Compiler/ExternalInterpreter][GHCs External Interpreter]] splits GHC into two components the haskell
compiler =ghc= and the interpreter server =iserv=. Passing
=-fexternal-interpreter= to =ghc= will spawn an =iserv= instance and run all
interpreted code through it. =ghc= can instruct =iserv= to load and link
libraries as needed, and evaluate bytecode objects. =iserv= in turn can
query =ghc= for the current compilation environment during the
evaluation.

*** Splitting iserv
    :PROPERTIES:
    :ID:       562F42AA-3BCF-4C58-8D7E-4A5EA1FCBF77
    :END:

For the cross compilation scenario, we need a to split =iserv= into two
parts, an =iserv-proxy= which serves as the =iserv= interface to GHC on
the /build/ machine. And an =GHCSlave= on the /host/ machine. This means we
need to move from

#+BEGIN_EXAMPLE
  .---------------.
  | GHC <-> iserv |
  '---------------'
    build machine
#+END_EXAMPLE

to a setup that looks more like

#+BEGIN_EXAMPLE
      build machine            host machine
  .-----------------------.   .------------.
  | GHC <-> iserv-proxy <-+---+-> GHCSlave |
  '-----------------------' ^ '------------'
         ^                  |
         |                  '-- communication via sockets
         '-- communication via pipes
#+END_EXAMPLE

/Note: I will not go into the technical details of the/ =iserv-proxy= /and/
=iserv= /library to be used in the/ =GHCSlave= /in this post./

*** Building GHC
    :PROPERTIES:
    :ID:       9B961EEF-DD49-4CF7-BE3C-9CB0E610E408
    :END:

In [[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-raspberry-pi-ddd9d41ced94][A Haskell Cross Compiler for Raspberry Pi]] we have seen how to build
a cross compiling GHC. As this is still work in progress and not all
diffs have been merged, or are updated and rebased onto GHCs master
branch on a regular basis, you will need a very recent copy (as recent
as today!).

#+BEGIN_EXAMPLE
  git clone --recursive git://git.haskell.org/ghc.git
  cd ghc
  git remote add zw3rk https://github.com/zw3rk/ghc.git
  git fetch zw3rk
  git checkout -b zw3rk/my-ghc
  git reset --hard zw3rk/my-ghc
  git submodule update --init --recursive
#+END_EXAMPLE

Following the build instructions in [[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-raspberry-pi-ddd9d41ced94][A Haskell Cross Compiler for
Raspberry Pi]] should yield an up to date =arm-linux-gnueabihf-ghc=.

/Note: The hard reset is needed, as/ =zw3rk/my-ghc= /is periodically
force pushed. Please let me know of a better solution!/

*** Building iserv
    :PROPERTIES:
    :ID:       207C5C3A-5D5B-4EED-BF4F-FA6A8B3278FA
    :END:

To build =iserv-proxy= we will use =ghc= (the GHC that builds on and for
the build machine), as the proxy needs to be able to run on the /build/
machine. The =iserv-bin= package, which contains the =iserv-proxy= is part
of the ghc tree, and can be found in the =iserv= subfolder. We can
simply build and install it by saying

#+BEGIN_EXAMPLE
  ghc/iserv $ cabal install -flibrary -fproxy
#+END_EXAMPLE

This should build and install =$HOME/.cabal/bin/iserv-proxy=.

*** Building GHCSlave
    :PROPERTIES:
    :ID:       223E8384-59FF-453E-9E8E-752189F31F6F
    :END:

Next we need the GHCSlave to run on the Raspberry Pi. For this we need
the =iserv= library, to link into GHCSlave. To do this we need the
=arm-linux-gnueabihf-cabal= we created in [[https://medium.com/@zw3rk/the-haskell-cabal-and-cross-compilation-e9885fd5e2f][The Haskell Cabal and Cross
Compilation]].

#+BEGIN_EXAMPLE
  ghc/iserv $ arm-linux-genueabihf-cabal install -flibrary
#+END_EXAMPLE

Next, we will build =RPi/Slave.hs= from the =ghc-slave= repository:

#+BEGIN_EXAMPLE
  git clone https://github.com/zw3rk/ghc-slave.git
  cd ghc-slave/RPi
  arm-linux-gnueabihf-ghc Slave.hs
#+END_EXAMPLE

This should provide the =Slave= executable for the Raspberry Pi. Because
the =Slave= binary links against the =libffi= shared object we built when
building the =arm-linux-gnueabihf-ghc=, we need that on the Raspberry Pi
as well:

#+BEGIN_EXAMPLE
  scp path/to/libffi/arm-linux-gnueabihf/lib/libffi.so.7 \
      pi@raspberrypi:
  scp Slave pi@raspberrypi:
#+END_EXAMPLE

On the Raspberry Pi, we will need a temporary folder =$HOME/slave=,
where GHCSlave store libraries and objects needed for the evaluation
of splices.

#+BEGIN_EXAMPLE
  pi@raspberrypi:~ $ mkdir $HOME/slave
#+END_EXAMPLE

With all this properly set up we can start the GHCSlave on the
Raspberry Pi

#+BEGIN_EXAMPLE
  pi@raspberrypi:~ $ LD_LIBRARY_PATH=$HOME ./Slave $HOME/slave 5000
#+END_EXAMPLE

*** Compiling Template Haskell via GHCSlave
    :PROPERTIES:
    :ID:       2E5D25FE-7053-4ACF-9E26-E2C48DE55C69
    :END:

On to the exciting part! As we now have =iserv-proxy= on the build
machine, and =GHCSlave= on the host, we finally have a /fully functioning
cross compiler with Template Haskell support!/

Let us use [[https://github.com/quchen][David Luposchainsky]]
[[https://github.com/quchen/articles/blob/master/useful_techniques.md#poor-mans-supercompiler][poor
man's supercompiler]] as an example.

#+BEGIN_EXAMPLE
  -- File: TH.hs
  {-# LANGUAGE TemplateHaskell #-}
  {-# LANGUAGE BangPatterns #-}
  module TH where
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  import Language.Haskell.TH.Syntax
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  -- Calculate the n-th Fibonacci number's last 10 digits in O(n).
  fibo :: Integer -> Integer
  fibo = (`rem` 10^10) . fibo' (0, 1)
        where fibo' (a,_) 0 = a
              fibo' (!a,!b) n = fibo' (b, a + b) (n - 1)

  -- Wraps an Integer in(to) a Q Exp
  wrapTH :: Integer -> Q Exp
  wrapTH n = [| n |]

  -- | Wrap a certain Fibonacci number in an expression
  fiboTH :: Integer -> Q Exp
  fiboTH n = wrapTH (fibo n)
#+END_EXAMPLE

and the =Main= module:

#+BEGIN_EXAMPLE
  -- File: Main.hs

  {-# LANGUAGE TemplateHaskell #-}

  import TH

  myFibo :: Integer
  myFibo = $( fiboTH (10^5) )

  main = print myFibo
#+END_EXAMPLE

Compiling this should be as simple as

#+BEGIN_EXAMPLE
  arm-linux-gnueabihf-ghc -fexternal-interpreter \
      -pgmi $HOME/.cabal/bin/iserv-proxy \
      -opti10.0.1.1 -opti5000 \
      TH.hs Main.hs
#+END_EXAMPLE

assuming your Raspberry Pis IP is =10.0.1.1=.

*** Compiling a Cabal Package that required Template Haskell
    :PROPERTIES:
    :ID:       11DD9D70-1DD1-4AFB-A851-98ED609484D3
    :END:

As [[https://medium.com/@zw3rk/template-haskell-and-cross-compilation-16b92f40c6ab][we have seen yesterday]], the [[https://hackage.haskell.org/package/file-embed][file-embed]] package as well as the
[[https://hackage.haskell.org/package/gitrev][gitrev]] package use Template Haskell (and the file system and =git=
process).  The [[https://phabricator.haskell.org/D3502][initial patch]] to enable file system access and process
IO tried to do this transparently by hooking into GHCs Runtime
System. This proved to be rather inelegant. A [[https://phabricator.haskell.org/D3608][revised patch]] extends
the Quasi class. The drawback is that packages need to be adapted to
the new Quasi class and be more explicit about the file system and
process IO to work with cross compilation.

With some [[https://github.com/zw3rk/file-embed/commit/679b3690e1edf53986ea3af83e99115fdc32b75c][minor]] [[https://github.com/zw3rk/gitrev/commit/958f5bf8fd5d16c22f282a96d54ad1f8ddae5240][alterations]] to the file-embed and gitrev package, we
can make them work with the new features, let's install them.

#+BEGIN_EXAMPLE
  git clone https://github.com/zw3rk/file-embed.git
  (cd file-embed && arm-linux-gnueabihf-cabal install)
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  git clone https://github.com/zw3rk/gitrev.git
  (cd gitrev && arm-linux-gnueabihf-cabal install)
#+END_EXAMPLE

So far so good. Now, let us try the [[https://github.com/zw3rk/medium/tree/master/template-haskell-and-cross-compilation][contrived example]] from [[https://medium.com/@zw3rk/template-haskell-and-cross-compilation-16b92f40c6ab][yesterday]]

#+BEGIN_EXAMPLE
  git clone https://github.com/zw3rk/medium.git
  cd medium/template-haskell-and-cross-compilation
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # configure the th-example package without shared
  arm-linux-gnueabihf-cabal configure --disable-shared
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # build it with cabal
  arm-linux-gnueabihf-cabal build \
     --ghc-options="-fexternal-interpreter \
                    -pgmi $HOME/.cabal/bin/iserv-proxy \
                    -opti10.0.1.1 -opti5000"
#+END_EXAMPLE

/Note: you will need to have the the/ =Slave= /process running on your
Raspberry Pi at IP/ =10.0.1.1=/./

This will produce
=dist/arm-linux-gnueabihf/build/th-example/th-example=. Copying it over
to the Raspberry Pi and executing it should /just work/:

#+BEGIN_EXAMPLE
  scp dist/arm-linux-gnueabihf/build/th-example/th-example \
      pi@raspberrypi:
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  ssh pi@raspberrypi 'LD_LIBRARY_PATH=. ./th-example --version'
#+END_EXAMPLE

And yield =Version 32b8bbb75cf8910443397bfab6b194c8e6d36d47=.

*** Current Limitations
    :PROPERTIES:
    :ID:       8833786C-DF56-4651-9263-C6C896321BF8
    :END:

As we saw, packages that use file or process IO, need to be adapted to
use the new more explicit API to work. It should also be noted that
all this is quite new code, and not all differentials have landed in
master yet. I am quite certain there will be bugs, however I'd like to
encourage you to try this out and provide feedback, PRs and
bugreports!

